app/controllers/api/pins_controller.rb

INSERT INTO "pins" ("title", "description", "link", "creator_id", "created_at", "updated_at", "board_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asdfa"], ["description", ""], ["link", ""], ["creator_id", 7], ["created_at", "2019-12-17 16:56:00.014847"], ["updated_at", "2019-12-17 16:56:00.014847"], ["board_id", 1]]
---
  def create
    # debugger
    # @pin = Pin.new(pin_params)
    @pin = current_user.created_pins.new(pin_params)