app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "age", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
# debugger
    if @user.save